# Working with Missing Data in Pandas

In Pandas, missing data occurs when some values are missing or not collected properly and these missing values are represented as:

None: A Python object used to represent missing values in object-type arrays.
NaN: A special floating-point value from NumPy which is recognized by all systems that use IEEE floating-point standards.

1. Using isnull()
isnull() returns a DataFrame of Boolean value where True represents missing data (NaN). This is simple if we want to find and fill missing data in a dataset.

Example 1: Finding Missing Values in a DataFrame

**Observations:**
- The isnull() function checks each value in the DataFrame
- Empty/missing values (np.nan) are marked as True
- Values that contain data are marked as False

__interpretation and findings:__
- np.nan (missing data) displays as True because it represents the absence of data
- Numbers with actual values display as False because they are valid data points
- This boolean output helps us quickly locate where data is missing in the DataFrame

In [1]:
import pandas as pd
import numpy as np

d = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score': [np.nan, 40, 80, 98]}
df = pd.DataFrame(d)

mv = df.isnull()

print(mv)

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

Example 2: Filtering Data Based on Missing Values

Here we used random Employee dataset. The isnull() function is used over the "Gender" column in order to filter and print out rows containing missing gender data.

**Observations:**
- pd.isnull(d["Gender"]) creates a True/False list for Gender column
- d[bool_series] filters to show only rows where Gender is True (missing)
- The output shows multiple employee records all have NaN in Gender column

__interpretation and findings:__
- We found which employees have missing gender data
- This helps us identify incomplete records so we can fill them or handle them before analysis

In [ ]:
d = pd.read_csv("Imports/employees.csv")

bool_series = pd.isnull(d["Gender"])
missing_gender_data = d[bool_series]
print(missing_gender_data)

    First Name Gender  Start Date Last Login Time  Salary  Bonus %  \
20        Lois    NaN   4/22/1995         7:18 PM   64714    4.934
22      Joshua    NaN    3/8/2012         1:58 AM   90816   18.816
27       Scott    NaN   7/11/1991         6:58 PM  122367    5.218
31       Joyce    NaN   2/20/2005         2:40 PM   88657   12.752
41   Christine    NaN   6/28/2015         1:08 AM   66582   11.308
..         ...    ...         ...             ...     ...      ...
961    Antonio    NaN   6/18/1989         9:37 PM  103050    3.050
972     Victor    NaN   7/28/2006         2:49 PM   76381   11.159
985    Stephen    NaN   7/10/1983         8:10 PM   85668    1.909
989     Justin    NaN   2/10/1991         4:58 PM   38344    3.794
995      Henry    NaN  11/23/2014         6:09 AM  132483   16.655

    Senior Management                  Team
20               True                 Legal
22               True       Client Services
27              False                 Legal
31              False               Product
41               True  Business Development
..                ...                   ...
961             False                 Legal
972              True                 Sales
985             False                 Legal
989             False                 Legal
995             False          Distribution

[145 rows x 8 columns]

2. Using isna()
isna() returns a DataFrame of Boolean values where True indicates missing data (NaN). It is used to detect missing values just like isnull().

Example: Finding Missing Values in a DataFrame

**Observations:**
- we can see that when value is inputed in the data it shows as false for data that has value and shows true for data that has no input or value np.nan
- np.nan will be true while the rest shows as false

__interpretation and findings:__
- the isna() detects missing data in the same way as isnull()
- We can see exactly which cells have missing values

In [ ]:
data = {'Name': ['Amit', 'Sita', np.nan, 'Raj'],
        'Age': [25, np.nan, 22, 28]}

df = pd.DataFrame(data)

# Check for missing values using isna()
print(df.isna())

    Name    Age
0  False  False
1  False   True
2   True  False
3  False  False

3. Checking for Non-Missing Values Using notnull()
notnull() function returns a DataFrame with Boolean values where True indicates non-missing (valid) data. This function is useful when we want to focus only on the rows that have valid, non-missing values.

Example 1: Identifying Non-Missing Values in a DataFrame

**Observations:**
- when I use notnull() on my data, it shows True for values that exist and False for missing values
- it does the opposite of what isnull() and isna() do 

__interpretation and findings:__
- notnull() helps me see which data is good and complete
- I can now identify exactly which cells have valid values that I can use
- this is useful when I want to keep only rows with complete information

In [4]:
d = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score': [np.nan, 40, 80, 98]}
df = pd.DataFrame(d)

nmv = df.notnull()

print(nmv)

   First Score  Second Score  Third Score
0         True          True        False
1         True          True         True
2        False          True         True
3         True         False         True

Example 2: Filtering Data with Non-Missing Values

notnull() function is used over the "Gender" column in order to filter and print out rows containing missing gender data.

**Observations:**
- when I use pd.notnull(d["Gender"]), it creates a True/False list for the Gender column
- d[nmg] filters to show only rows where Gender is True (has data, not NaN)
- the output shows only the employee records that have valid Gender values

__interpretation and findings:__
- I can now see only employees with complete gender information
- this helps me focus on clean data without worrying about missing values
- I can use this filtered data for calculations and analysis

In [6]:
import pandas as pd
d = pd.read_csv("Imports/employees.csv")

nmg = pd.notnull(d["Gender"])

nmgd= d[nmg]

display(nmgd)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
994,George,Male,6/21/2013,5:47 PM,98874,4.479,True,Marketing
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

Filling Missing Values in Pandas
Following functions allow us to replace missing values with a specified value or use interpolation methods to find the missing data.

1. Using fillna()
fillna() used to replace missing values (NaN) with a given value. Lets see various example for this.

Example 1: Fill Missing Values with Zero

**Observations:**
- when I use fillna(0), it replaces all the missing NaN values with 0
- all other values stay the same but with added decimal points for all

__interpretation and findings:__
- fillna(0) is a quick way to replace missing data with a number like zero
- this is useful when I need complete data without any empty cells

In [8]:
d = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score': [np.nan, 40, 80, 98]}
df = pd.DataFrame(d)

df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

Example 2: Fill with Previous Value (Forward Fill)

The pad method is used to fill missing values with the previous value.

**Observations:**
- when I use fillna(method='pad'), each NaN gets filled with the value just above it
- I see the gaps get filled forward, so earlier valid numbers repeat downward
- the rest of the data stays the same

__interpretation and findings:__
- forward fill is handy when I want to carry the last known value down to fill gaps
- this keeps trends continuous without dropping rows
- useful when missing points should inherit the most recent previous value

In [9]:
df.fillna(method='pad')

C:\Users\ASUS\AppData\Local\Temp\ipykernel_28220\196241153.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='pad')

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         90.0          56.0         80.0
3         95.0          56.0         98.0

Example 3: Fill with Next Value (Backward Fill)

The bfill function is used to fill it with the next value.

**Observations:**
- when using fillna(method='bfill'), each NaN gets filled with the value just below it
- I see the gaps get filled upward, so later valid numbers move up to replace missing ones
- the rest of the data stays the same

__interpretation and findings:__
- backward fill is handy when I want to use the next known value to plug the gaps
- this keeps sequences intact without dropping rows
- useful when missing points should inherit the next available value

In [10]:
df.fillna(method='bfill')

C:\Users\ASUS\AppData\Local\Temp\ipykernel_28220\2831856154.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

   First Score  Second Score  Third Score
0        100.0          30.0         40.0
1         90.0          45.0         40.0
2         95.0          56.0         80.0
3         95.0           NaN         98.0

Example 4: Fill NaN Values with 'No Gender'

**Observations:**
- I’m filling missing Gender values with the label "No Gender"
- after fillna, the Gender column shows "No Gender" where NaN used to be
- rows 10 to 24 now have no blanks in Gender

__interpretation and findings:__
- replacing NaN with "No Gender" keeps the dataset consistent for analysis
- I can proceed without losing rows due to missing Gender
- this makes grouping and counting by Gender straightforward

In [11]:
d = pd.read_csv("Imports/employees.csv")

d[10:25]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,8/12/1980,9:01 AM,63241,15.132,True,NaN
11,Julie,Female,10/26/1997,3:19 PM,102508,12.637,True,Legal
12,Brandon,Male,12/1/1980,1:08 AM,112807,17.492,True,Human Resources
13,Gary,Male,1/27/2008,11:40 PM,109831,5.831,False,Sales
14,Kimberly,Female,1/14/1999,7:13 AM,41426,14.543,True,Finance
15,Lillian,Female,6/5/2016,6:09 AM,59414,1.256,False,Product
16,Jeremy,Male,9/21/2010,5:56 AM,90370,7.369,False,Human Resources
17,Shawn,Male,12/7/1986,7:45 PM,111737,6.414,False,Product
18,Diana,Female,10/23/1981,10:27 AM,132940,19.082,False,Client Services
19,Donna,Female,7/22/2010,3:48 AM,81014,1.894,False,Product
20,Lois,NaN,4/22/1995,7:18 PM,64714,4.934,True,Legal
21,Matthew,Male,9/5/1995,2:12 AM,100612,13.645,False,Marketing
22,Joshua,NaN,3/8/2012,1:58 AM,90816,18.816,True,Client Services
23,NaN,Male,6/14/2012,4:19 PM,125792,5.042,NaN,NaN
24,John,Male,7/1/1992,10:08 PM,97950,13.873,False,Client Services

In [12]:
d["Gender"].fillna('No Gender', inplace = True) 
d[10:25]

C:\Users\ASUS\AppData\Local\Temp\ipykernel_28220\1225287812.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  d["Gender"].fillna('No Gender', inplace = True)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,8/12/1980,9:01 AM,63241,15.132,True,NaN
11,Julie,Female,10/26/1997,3:19 PM,102508,12.637,True,Legal
12,Brandon,Male,12/1/1980,1:08 AM,112807,17.492,True,Human Resources
13,Gary,Male,1/27/2008,11:40 PM,109831,5.831,False,Sales
14,Kimberly,Female,1/14/1999,7:13 AM,41426,14.543,True,Finance
15,Lillian,Female,6/5/2016,6:09 AM,59414,1.256,False,Product
16,Jeremy,Male,9/21/2010,5:56 AM,90370,7.369,False,Human Resources
17,Shawn,Male,12/7/1986,7:45 PM,111737,6.414,False,Product
18,Diana,Female,10/23/1981,10:27 AM,132940,19.082,False,Client Services
19,Donna,Female,7/22/2010,3:48 AM,81014,1.894,False,Product
20,Lois,No Gender,4/22/1995,7:18 PM,64714,4.934,True,Legal
21,Matthew,Male,9/5/1995,2:12 AM,100612,13.645,False,Marketing
22,Joshua,No Gender,3/8/2012,1:58 AM,90816,18.816,True,Client Services
23,NaN,Male,6/14/2012,4:19 PM,125792,5.042,NaN,NaN
24,John,Male,7/1/1992,10:08 PM,97950,13.873,False,Client Services

2. Using replace()
Use replace() function to replace NaN values with a specific value.

**Observations:**
- I’m replacing all NaN values with -99 using replace()
- in rows 10–24, the missing entries now show as -99
- other non-missing values remain unchanged

__interpretation and findings:__
- using replace() lets me standardize missing values to a numeric placeholder
- this avoids NaNs when doing numeric computations or exports
- I can later filter or impute by targeting the -99 marker

In [13]:
data = pd.read_csv("Imports/employees.csv")
data[10:25]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,8/12/1980,9:01 AM,63241,15.132,True,NaN
11,Julie,Female,10/26/1997,3:19 PM,102508,12.637,True,Legal
12,Brandon,Male,12/1/1980,1:08 AM,112807,17.492,True,Human Resources
13,Gary,Male,1/27/2008,11:40 PM,109831,5.831,False,Sales
14,Kimberly,Female,1/14/1999,7:13 AM,41426,14.543,True,Finance
15,Lillian,Female,6/5/2016,6:09 AM,59414,1.256,False,Product
16,Jeremy,Male,9/21/2010,5:56 AM,90370,7.369,False,Human Resources
17,Shawn,Male,12/7/1986,7:45 PM,111737,6.414,False,Product
18,Diana,Female,10/23/1981,10:27 AM,132940,19.082,False,Client Services
19,Donna,Female,7/22/2010,3:48 AM,81014,1.894,False,Product
20,Lois,NaN,4/22/1995,7:18 PM,64714,4.934,True,Legal
21,Matthew,Male,9/5/1995,2:12 AM,100612,13.645,False,Marketing
22,Joshua,NaN,3/8/2012,1:58 AM,90816,18.816,True,Client Services
23,NaN,Male,6/14/2012,4:19 PM,125792,5.042,NaN,NaN
24,John,Male,7/1/1992,10:08 PM,97950,13.873,False,Client Services

In [14]:
data = data.replace(to_replace=np.nan, value=-99)
print(data[10:25])

   First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
10     Louise  Female   8/12/1980         9:01 AM   63241   15.132
11      Julie  Female  10/26/1997         3:19 PM  102508   12.637
12    Brandon    Male   12/1/1980         1:08 AM  112807   17.492
13       Gary    Male   1/27/2008        11:40 PM  109831    5.831
14   Kimberly  Female   1/14/1999         7:13 AM   41426   14.543
15    Lillian  Female    6/5/2016         6:09 AM   59414    1.256
16     Jeremy    Male   9/21/2010         5:56 AM   90370    7.369
17      Shawn    Male   12/7/1986         7:45 PM  111737    6.414
18      Diana  Female  10/23/1981        10:27 AM  132940   19.082
19      Donna  Female   7/22/2010         3:48 AM   81014    1.894
20       Lois     -99   4/22/1995         7:18 PM   64714    4.934
21    Matthew    Male    9/5/1995         2:12 AM  100612   13.645
22     Joshua     -99    3/8/2012         1:58 AM   90816   18.816
23        -99    Male   6/14/2012         4:19 PM  125792    5.042
24       John    Male    7/1/1992        10:08 PM   97950   13.873

   Senior Management             Team
10              True              -99
11              True            Legal
12              True  Human Resources
13             False            Sales
14              True          Finance
15             False          Product
16             False  Human Resources
17             False          Product
18             False  Client Services
19             False          Product
20              True            Legal
21             False        Marketing
22              True  Client Services
23               -99              -99
24             False  Client Services

3. Using interpolate()
The interpolate() function fills missing values using interpolation techniques such as the linear method.

**Observations:**
- linear interpolation fills NaNs by drawing straight-line estimates between known numeric values
- with limit_direction='forward', gaps are filled moving forward until a valid next value is found
- non-missing values stay unchanged

__interpretation and findings:__
- suitable for numeric data where a linear trend between points is reasonable
- preserves DataFrame shape while removing NaNs
- best avoided on categorical columns; apply per-column as needed

In [15]:
df = pd.DataFrame({"A": [12, 4, 5, None, 1], 
                   "B": [None, 2, 54, 3, None], 
                   "C": [20, 16, None, 3, 8], 
                   "D": [14, 3, None, None, 6]})  
print(df)

      A     B     C     D
0  12.0   NaN  20.0  14.0
1   4.0   2.0  16.0   3.0
2   5.0  54.0   NaN   NaN
3   NaN   3.0   3.0   NaN
4   1.0   NaN   8.0   6.0

In [16]:
df.interpolate(method ='linear', limit_direction ='forward')

      A     B     C     D
0  12.0   NaN  20.0  14.0
1   4.0   2.0  16.0   3.0
2   5.0  54.0   9.5   4.0
3   3.0   3.0   3.0   5.0
4   1.0   3.0   8.0   6.0

# Dropping Missing Values in Pandas
The dropna() function used to removes rows or columns with NaN values. It can be used to drop data based on different conditions.

1. Dropping Rows with At Least One Null Value
Remove rows that contain at least one missing value.

**Observations:**
- df.dropna() removes any row that has at least one NaN
- in this data, only the last row (all numeric) survives; rows with NaNs are dropped
- columns remain unchanged; only rows are filtered out

__interpretation and findings:__
- use dropna() to keep only fully complete rows
- this reduces dataset size but guarantees no missing values remain in kept rows
- consider imputation if you need to preserve more rows

In [ ]:
dict = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score': [52, 40, 80, 98],
        'Fourth Score': [np.nan, np.nan, np.nan, 65]}
df = pd.DataFrame(dict)

df.dropna()

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

2. Dropping Rows with All Null Values
We can drop rows where all values are missing using dropna(how='all').

**Observations:**
- df.dropna(how='all') removes only rows where every column is NaN
- rows that have at least one real value remain in the DataFrame
- in this dataset, no row is entirely NaN, so all rows are kept

__interpretation and findings:__
- use how='all' when you only want to discard completely empty rows
- this preserves partially filled rows so you can still impute or analyze them
- it’s safer than the default dropna() when sparse data should be retained

In [19]:
dict = {'First Score': [100, np.nan, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score': [52, np.nan, 80, 98],
        'Fourth Score': [np.nan, np.nan, np.nan, 65]}
df = pd.DataFrame(dict)

df.dropna(how='all')

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0         52.0           NaN
2          NaN          45.0         80.0           NaN
3         95.0          56.0         98.0          65.0

3. Dropping Columns with At Least One Null Value
To remove columns that contain at least one missing value we use dropna(axis=1).

**Observations:**
- df.dropna(axis=1) removes columns that contain at least one NaN
- First Score, Second Score, and Third Score all have NaNs so they get dropped
- only Fourth Score survives because it has no missing values

__interpretation and findings:__
- use axis=1 when you want to discard entire columns with any missing data
- this approach keeps only fully complete columns
- useful when you need columns with no gaps for analysis, but reduces available features

In [20]:
dict = {'First Score': [100, np.nan, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score': [52, np.nan, 80, 98],
        'Fourth Score': [60, 67, 68, 65]}
df = pd.DataFrame(dict)

df.dropna(axis=1)

   Fourth Score
0            60
1            67
2            68
3            65

4. Dropping Rows with Missing Values in CSV Files
When working with CSV files, we can drop rows with missing values using dropna().

**Observations:**
- Loads the employees.csv file into DataFrame d
- dropna(axis=0, how='any') removes any row containing at least one NaN value
- Prints the original row count, cleaned row count, and rows removed

__interpretation and findings:__
- Shows how many rows had missing data that were removed
- Helps quantify data quality issues in the dataset
- The difference tells you what percentage of data was incomplete

In [23]:
import pandas as pd
d = pd.read_csv("Imports/employees.csv")

nd = d.dropna(axis=0, how='any')

print("Old data frame length:", len(d))
print("New data frame length:", len(nd))
print("Rows with at least one missing value:", (len(d) - len(nd)))

Old data frame length: 1000
New data frame length: 764
Rows with at least one missing value: 236